In [78]:
import pandas as pd

In [79]:
# 2 Main Data Types
Series =  pd.Series(["BMW", "HONDA", "TOYOTA"])

In [80]:
Series

0       BMW
1     HONDA
2    TOYOTA
dtype: object

In [81]:
Colours = pd.Series(["Red", "Green", "Blue"])

In [82]:
#DataFrame (2D Array)
Car_Data = pd.DataFrame({"CarBrand": Series, "CarColor": Colours})

In [83]:
Car_Data

  CarBrand CarColor
0      BMW      Red
1    HONDA    Green
2   TOYOTA     Blue

In [84]:
#ImportData
Car_Sales = pd.read_csv("car-sales.csv")

In [85]:
Car_Sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

##DescribeData

In [86]:
#Attribute\
Car_Sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [87]:
Car_Sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [88]:
Car_Sales.index

RangeIndex(start=0, stop=10, step=1)

In [89]:
Car_Sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [90]:
Car_Sales.mean()

TypeError: Could not convert ['ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyotaNissan'
 'WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite'
 '$4,000.00$5,000.00$7,000.00$22,000.00$3,500.00$4,500.00$7,500.00$7,000.00$6,250.00$9,700.00'] to numeric

In [ ]:
Car_Sales.sum()

In [ ]:
Car_Sales["Doors"].sum()

In [ ]:
len(Car_Sales)

## View and Select Data

In [ ]:
##Return first 5
Car_Sales.head()

In [ ]:
Car_Sales.head(7)

In [ ]:
Car_Sales.tail()

In [ ]:
# .loc & iloc
animals = pd.Series(["cat", "dog", "bird", "panda", "snake" ], index=[0,3,9,8,3])

In [ ]:
animals

In [ ]:
#loc refer to Index
animals.loc[3]

In [ ]:
Car_Sales.loc[3]

In [ ]:
#iloc refer to position top to bottom
animals.iloc[3]

In [ ]:
animals.iloc[:3]

In [ ]:
animals.iloc[3:]

In [ ]:
# Get col with a filter
Car_Sales[Car_Sales["Make"] == "Toyota"]

In [ ]:
# Will provide cross of Make and Doors col from Car_Sales
pd.crosstab(Car_Sales["Make"], Car_Sales["Doors"])

In [ ]:
#Groupby should make group of similar makes and take mean of their all properties serprately
Car_Sales.groupby(["Make"]).mean()

In [ ]:
#If plot is not working
#Try %matplotlib inline import matplotlibas plt



Car_Sales["Odometer (KM)"].plot()

In [ ]:
Car_Sales["Odometer (KM)"].hist()

In [91]:
Car_Sales["Price"] = Car_Sales["Price"].str.replace(',','')
Car_Sales["Price"] = Car_Sales["Price"].str.replace('.','')
Car_Sales["Price"] = Car_Sales["Price"].str.replace('$','')
Car_Sales["Price"] = Car_Sales["Price"].str.replace('^','')

In [92]:
Car_Sales["Price"] = Car_Sales["Price"].astype(int)

In [93]:
Car_Sales

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   400000
1   Honda    Red          87899      4   500000
2  Toyota   Blue          32549      3   700000
3     BMW  Black          11179      5  2200000
4  Nissan  White         213095      4   350000
5  Toyota  Green          99213      4   450000
6   Honda   Blue          45698      4   750000
7   Honda   Blue          54738      4   700000
8  Toyota  White          60000      4   625000
9  Nissan  White          31600      4   970000

## Manipulating DATA

In [94]:
Car_Sales["Make"].str.lower()

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

In [95]:
Car_Sales_Missing = pd.read_csv("car-sales-missing-data.csv")

In [96]:
Car_Sales_Missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [100]:
Car_Sales_Missing["Odometer"].fillna(Car_Sales_Missing["Odometer"].mean(), inplace=True)

In [101]:
Car_Sales_Missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [106]:
#Drop missing rows
Car_Sales_Missing.dropna(inplace=True)

In [107]:
Car_Sales_Missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [109]:
#Coulumn from series
Seats_Column = pd.Series([5,5,5,5,5])

#New column called seats
Car_Sales["Seats"] = Seats_Column
Car_Sales

     Make Colour  Odometer (KM)  Doors    Price  Seats
0  Toyota  White         150043      4   400000    5.0
1   Honda    Red          87899      4   500000    5.0
2  Toyota   Blue          32549      3   700000    5.0
3     BMW  Black          11179      5  2200000    5.0
4  Nissan  White         213095      4   350000    5.0
5  Toyota  Green          99213      4   450000    NaN
6   Honda   Blue          45698      4   750000    NaN
7   Honda   Blue          54738      4   700000    NaN
8  Toyota  White          60000      4   625000    NaN
9  Nissan  White          31600      4   970000    NaN

In [110]:
Car_Sales["Seats"].fillna(5, inplace=True)
Car_Sales

     Make Colour  Odometer (KM)  Doors    Price  Seats
0  Toyota  White         150043      4   400000    5.0
1   Honda    Red          87899      4   500000    5.0
2  Toyota   Blue          32549      3   700000    5.0
3     BMW  Black          11179      5  2200000    5.0
4  Nissan  White         213095      4   350000    5.0
5  Toyota  Green          99213      4   450000    5.0
6   Honda   Blue          45698      4   750000    5.0
7   Honda   Blue          54738      4   700000    5.0
8  Toyota  White          60000      4   625000    5.0
9  Nissan  White          31600      4   970000    5.0

In [114]:
#Col from python list
Fuel_Economy = [7.5,9.2,8.2,5.0,6.4,9.2,8.2,9.3,4.1,3.1]
Car_Sales["Fuel per 100KM"] = Fuel_Economy
Car_Sales

     Make Colour  Odometer (KM)  Doors    Price  Seats  Fuel per 100KM
0  Toyota  White         150043      4   400000    5.0             7.5
1   Honda    Red          87899      4   500000    5.0             9.2
2  Toyota   Blue          32549      3   700000    5.0             8.2
3     BMW  Black          11179      5  2200000    5.0             5.0
4  Nissan  White         213095      4   350000    5.0             6.4
5  Toyota  Green          99213      4   450000    5.0             9.2
6   Honda   Blue          45698      4   750000    5.0             8.2
7   Honda   Blue          54738      4   700000    5.0             9.3
8  Toyota  White          60000      4   625000    5.0             4.1
9  Nissan  White          31600      4   970000    5.0             3.1

In [116]:
Car_Sales["Total fuel used"] = Car_Sales["Odometer (KM)"]/100 * Car_Sales["Fuel per 100KM"]
Car_Sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used
0,Toyota,White,150043,4,400000,5.0,7.5,11253.225
1,Honda,Red,87899,4,500000,5.0,9.2,8086.708
2,Toyota,Blue,32549,3,700000,5.0,8.2,2669.018
3,BMW,Black,11179,5,2200000,5.0,5.0,558.950
4,Nissan,White,213095,4,350000,5.0,6.4,13638.080
5,Toyota,Green,99213,4,450000,5.0,9.2,9127.596
6,Honda,Blue,45698,4,750000,5.0,8.2,3747.236
7,Honda,Blue,54738,4,700000,5.0,9.3,5090.634
8,Toyota,White,60000,4,625000,5.0,4.1,2460.000
9,Nissan,White,31600,4,970000,5.0,3.1,979.600

In [117]:
# Create a col from single value
Car_Sales["Number of Wheels"] = 4
Car_Sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used,Number of Wheels
0,Toyota,White,150043,4,400000,5.0,7.5,11253.225,4
1,Honda,Red,87899,4,500000,5.0,9.2,8086.708,4
2,Toyota,Blue,32549,3,700000,5.0,8.2,2669.018,4
3,BMW,Black,11179,5,2200000,5.0,5.0,558.950,4
4,Nissan,White,213095,4,350000,5.0,6.4,13638.080,4
5,Toyota,Green,99213,4,450000,5.0,9.2,9127.596,4
6,Honda,Blue,45698,4,750000,5.0,8.2,3747.236,4
7,Honda,Blue,54738,4,700000,5.0,9.3,5090.634,4
8,Toyota,White,60000,4,625000,5.0,4.1,2460.000,4
9,Nissan,White,31600,4,970000,5.0,3.1,979.600,4

In [118]:
Car_Sales =  Car_Sales.drop("Total fuel used", axis=1)
Car_Sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of Wheels
0,Toyota,White,150043,4,400000,5.0,7.5,4
1,Honda,Red,87899,4,500000,5.0,9.2,4
2,Toyota,Blue,32549,3,700000,5.0,8.2,4
3,BMW,Black,11179,5,2200000,5.0,5.0,4
4,Nissan,White,213095,4,350000,5.0,6.4,4
5,Toyota,Green,99213,4,450000,5.0,9.2,4
6,Honda,Blue,45698,4,750000,5.0,8.2,4
7,Honda,Blue,54738,4,700000,5.0,9.3,4
8,Toyota,White,60000,4,625000,5.0,4.1,4
9,Nissan,White,31600,4,970000,5.0,3.1,4

In [126]:
#Randomizing all data
Car_Sales_Shuffled = Car_Sales.sample(frac=1)

In [127]:
Car_Sales_Shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of Wheels
4,Nissan,White,213095,4,350000,5.0,6.4,4
8,Toyota,White,60000,4,625000,5.0,4.1,4
2,Toyota,Blue,32549,3,700000,5.0,8.2,4
7,Honda,Blue,54738,4,700000,5.0,9.3,4
6,Honda,Blue,45698,4,750000,5.0,8.2,4
3,BMW,Black,11179,5,2200000,5.0,5.0,4
0,Toyota,White,150043,4,400000,5.0,7.5,4
1,Honda,Red,87899,4,500000,5.0,9.2,4
5,Toyota,Green,99213,4,450000,5.0,9.2,4
9,Nissan,White,31600,4,970000,5.0,3.1,4

In [130]:
#Resetting Index
Car_Sales_Shuffled.reset_index(drop=True)

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of Wheels
0,Nissan,White,213095,4,350000,5.0,6.4,4
1,Toyota,White,60000,4,625000,5.0,4.1,4
2,Toyota,Blue,32549,3,700000,5.0,8.2,4
3,Honda,Blue,54738,4,700000,5.0,9.3,4
4,Honda,Blue,45698,4,750000,5.0,8.2,4
5,BMW,Black,11179,5,2200000,5.0,5.0,4
6,Toyota,White,150043,4,400000,5.0,7.5,4
7,Honda,Red,87899,4,500000,5.0,9.2,4
8,Toyota,Green,99213,4,450000,5.0,9.2,4
9,Nissan,White,31600,4,970000,5.0,3.1,4

In [132]:
Car_Sales["Odometer (KM)"] = Car_Sales["Odometer (KM)"].apply(lambda x: x/1.6)
Car_Sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of Wheels
0,Toyota,White,58610.546875,4,400000,5.0,7.5,4
1,Honda,Red,34335.546875,4,500000,5.0,9.2,4
2,Toyota,Blue,12714.453125,3,700000,5.0,8.2,4
3,BMW,Black,4366.796875,5,2200000,5.0,5.0,4
4,Nissan,White,83240.234375,4,350000,5.0,6.4,4
5,Toyota,Green,38755.078125,4,450000,5.0,9.2,4
6,Honda,Blue,17850.781250,4,750000,5.0,8.2,4
7,Honda,Blue,21382.031250,4,700000,5.0,9.3,4
8,Toyota,White,23437.500000,4,625000,5.0,4.1,4
9,Nissan,White,12343.750000,4,970000,5.0,3.1,4